{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 4, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "uiii_input"}, "name": "uiii_input", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAYAAABDAAAAcxwAAAB8AGQAZACFAnwBZABkAIUCZABkAIUCZgQZAFMAKQFO\nqQApAtoBeNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB5\n2gdzbGljZV8x6gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [4, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 0}}, "name": "lambda", "inbound_nodes": [[["uiii_input", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAYAAABDAAAAcxwAAAB8AGQAZACFAnwBZABkAIUCZABkAIUCZgQZAFMAKQFO\nqQApAtoBeNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB5\n2gdzbGljZV8x6gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [4, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 1}}, "name": "lambda_1", "inbound_nodes": [[["uiii_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "uiii_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "uiii_conv", "inbound_nodes": [[["lambda", 0, 0, {}]], [["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAYAAABDAAAAcxwAAAB8AGQAZACFAnwBZABkAIUCZABkAIUCZgQZAFMAKQFO\nqQApAtoBeNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB5\n2gdzbGljZV8x6gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [4, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 2}}, "name": "lambda_2", "inbound_nodes": [[["uiii_input", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d", "inbound_nodes": [[["uiii_conv", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_1", "inbound_nodes": [[["uiii_conv", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAYAAABDAAAAcxwAAAB8AGQAZACFAnwBZABkAIUCZABkAIUCZgQZAFMAKQFO\nqQApAtoBeNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB5\n2gdzbGljZV8x6gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [4, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 3}}, "name": "lambda_3", "inbound_nodes": [[["uiii_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["global_max_pooling1d", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_2", "inbound_nodes": [[["uiii_conv", 2, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAYAAABDAAAAcxwAAAB8AGQAZACFAnwBZABkAIUCZABkAIUCZgQZAFMAKQFO\nqQApAtoBeNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB5\n2gdzbGljZV8x6gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [4, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 4}}, "name": "lambda_4", "inbound_nodes": [[["uiii_input", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["global_max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_3", "inbound_nodes": [[["uiii_conv", 3, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["concatenate", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["global_max_pooling1d_3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_4", "inbound_nodes": [[["uiii_conv", 4, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["dropout_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["global_max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["dropout_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [5, 128]}, "name": "reshape_2", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d_5", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "user_input"}, "name": "user_input", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_4", "inbound_nodes": [[["global_max_pooling1d_5", 0, 0, {}], ["global_max_pooling1d_5", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "item_input"}, "name": "item_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "user_feedback_embedding", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "user_feedback_embedding", "inbound_nodes": [[["user_input", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [2, 128]}, "name": "reshape_3", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_feedback_embedding", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_feedback_embedding", "inbound_nodes": [[["item_input", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [128]}, "name": "reshape", "inbound_nodes": [[["user_feedback_embedding", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [128]}, "name": "reshape_1", "inbound_nodes": [[["item_feedback_embedding", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAUAAABDAAAAcxYAAAB8AGQAZACFAnwBZABkAIUCZgMZAFMAKQFOqQApAtoB\neNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB52gdzbGlj\nZV8y7gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [128], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 0}}, "name": "lambda_5", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAUAAABDAAAAcxYAAAB8AGQAZACFAnwBZABkAIUCZgMZAFMAKQFOqQApAtoB\neNoFaW5kZXhyAQAAAHIBAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB52gdzbGlj\nZV8y7gAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [128], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"index": 1}}, "name": "lambda_6", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_5", "inbound_nodes": [[["reshape", 0, 0, {}], ["reshape_1", 0, 0, {}], ["lambda_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_6", "inbound_nodes": [[["reshape", 0, 0, {}], ["reshape_1", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "metapath_attention_layer_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "metapath_attention_layer_1", "inbound_nodes": [[["concatenate_5", 0, 0, {}]], [["concatenate_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "metapath_attention_layer_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "metapath_attention_layer_2", "inbound_nodes": [[["metapath_attention_layer_1", 0, 0, {}]], [["metapath_attention_layer_1", 1, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_7", "inbound_nodes": [[["metapath_attention_layer_2", 0, 0, {}], ["metapath_attention_layer_2", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "metapath_attention_softmax", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwoAAAB0AGoBfACDAVMAKQFOKQLaB2JhY2tlbmTaB3NvZnRt\nYXgpAdoBeKkAcgQAAAD6H0Q6L0JVQUEvZGV2X3B5L3RyYWluX3NlcnZpY2UucHnaCDxsYW1iZGE+\nagAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "metapath_attention_softmax", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcyAAAAB0AGoBfABkARkAdABqAnwAZAIZAGQDgwIUAGQCgwJT\nACkETukAAAAA6QEAAADp/////ykD2gdiYWNrZW5k2gNzdW3aC2V4cGFuZF9kaW1zKQHaAXipAHII\nAAAA+h9EOi9CVUFBL2Rldl9weS90cmFpbl9zZXJ2aWNlLnB52gg8bGFtYmRhPmwAAABzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["reshape_3", 0, 0, {}], ["metapath_attention_softmax", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["reshape", 0, 0, {}], ["lambda_7", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_9", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["lambda_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "user_attention_layer", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "user_attention_layer", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_attention_layer", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_attention_layer", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "user_attention_softmax", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwoAAAB0AGoBfACDAVMAKQFOKQLaB2JhY2tlbmTaB3NvZnRt\nYXgpAdoBeKkAcgQAAAD6H0Q6L0JVQUEvZGV2X3B5L3RyYWluX3NlcnZpY2UucHnaCDxsYW1iZGE+\neQAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "user_attention_softmax", "inbound_nodes": [[["user_attention_layer", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "item_attention_softmax", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwoAAAB0AGoBfACDAVMAKQFOKQLaB2JhY2tlbmTaB3NvZnRt\nYXgpAdoBeKkAcgQAAAD6H0Q6L0JVQUEvZGV2X3B5L3RyYWluX3NlcnZpY2UucHnaCDxsYW1iZGE+\nhgAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "item_attention_softmax", "inbound_nodes": [[["item_attention_layer", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["reshape", 0, 0, {}], ["user_attention_softmax", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["item_attention_softmax", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_10", "inbound_nodes": [[["multiply", 0, 0, {}], ["lambda_7", 0, 0, {}], ["multiply_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_layer0", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_layer0", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_layer1", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_layer1", "inbound_nodes": [[["item_layer0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_layer2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_layer2", "inbound_nodes": [[["item_layer1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "item_layer3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "item_layer3", "inbound_nodes": [[["item_layer2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "prediction", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "prediction", "inbound_nodes": [[["item_layer3", 0, 0, {}]]]}], "input_layers": [["user_input", 0, 0], ["item_input", 0, 0], ["uiii_input", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}